# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'dbcli/tap'

# Binaries
brew 'azure-cli'
brew 'awscli'
brew 'coreutils'
brew 'figlet'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'lolcat'
brew 'mackup'
brew 'mas'
brew 'source-highlight'
brew 'tree'

# Dev
brew 'jq'
brew 'litecli'
brew 'navi'
brew 'nvm'
brew 'pandoc'
brew 'rbenv'
brew 'tldr'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'fantastical'
cask 'firefox'
cask 'iterm2'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'obsidian'
cask 'powershell'
cask 'proxyman'
cask 'slack'
cask 'sequel-pro'
cask 'soundsource'
cask 'spotify'
cask 'visual-studio-code'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Calca', id: 635758264
mas 'Capo', id: 696977615
mas 'ColorSlurp', id: 1287239339
mas 'DuckDuckGo Privacy Essentials', id: 1482920575 
mas 'GIPHY CAPTURE', id: 668208984
mas 'Keynote', id: 409183694
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825 
mas 'Pages', id: 409201541 
mas 'Pixelmator', id: 407963104
mas 'Save to Pocket', id: 1477385213
mas 'Soulver', id: 413965349
mas 'Tab Space', id: 1473726602
mas 'Yoink', id: 457622435
