# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

tap 'dbcli/tap'
tap 'teamookla/speedtest'

# Utilities
brew 'ack'
brew 'colordiff'
brew 'coreutils'
brew 'figlet' # ASCII art generator
brew 'grep'
brew 'jq'
brew 'lolcat' # Like cat, but with rainbow colors
brew 'mas' # Mac App Store CLI
brew 'nmap' # Port scanning
brew 'source-highlight'
brew 'speedtest'
brew 'tree'
brew 'wget'

# Dev
brew 'adr-tools' # Arch Doc Records
brew 'azure-cli'
brew 'awscli'
brew 'gh'
brew 'git'
brew 'kubectl'
brew 'litecli' # SQLite CLI https://litecli.com
brew 'svn' # only used for installing powerline font
brew 'tldr'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'fantastical'
cask 'firefox'
cask 'gpg-suite'
cask 'iterm2'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'obsidian'
cask 'powershell'
cask 'proxyman'
cask 'slack'
cask 'sequel-pro'
cask 'soundsource'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Calca', id: 635758264
mas 'Capo', id: 696977615
mas 'ColorSlurp', id: 1287239339
mas 'DuckDuckGo Privacy Essentials', id: 1482920575 
mas 'GIPHY CAPTURE', id: 668208984
mas 'Keynote', id: 409183694
mas 'Klokki Slim - Time Tracking', id: 1459795140
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825 
mas 'Pages', id: 409201541 
mas 'Pixelmator', id: 407963104
mas 'Save to Pocket', id: 1477385213
mas 'Soulver', id: 413965349
mas 'Yoink', id: 457622435
